// 1. Використовуючи цикл "while" виведіть в консоль цифри від 0 до 10;
// * Зробіть те саме за допомогою циклу "do while" i "for"
let i = 0;
while (i < 10) {
  console.log(i);
  i++;
}

let i = 0;
do {
  console.log(i);
  i++;
} while (i < 10);

for (let i = 0; i < 10; i++) {
  console.log(i);
}
// 2. Яке останнє значення буде виведено в консоль?
// let i = 0;
//
// while (i > 10) {
//   console.log(i);
//   ++i;
// }

/* Код з тіла цикла виконується ,поки умова ()істинна
так як 0 не більше 10,воно припинить роботу,в мене не вивело нічого*,0>10 помилка/

// 3. Яке останнє значення буде виведено в консоль?
// let i = 0;
//
// do {
//   console.log(i);
//   ++i;
// } while (i < 10)

/* В консоль вивело 9, 0 не=10, цикл спочатку зробить тіло,
 а потім провірить умову(i<10) */

// 4. Замініть цей приклад використовуючи "while"
//
// for (let i = 0; i < 10; i++) {
//   console.log('i', i);
// }

let i = 0;
while (i < 10) {
  console.log("i", i);
  i++;
}

// 5. Яке перше значення буде виведено в консоль?
// let i = 0;
//
// while (i > 10) {
//   ++i;
//   console.log(i);
// }

/* Код з тіла цикла виконується ,поки умова ()істинна
так як 0 не більше 10,воно припинить роботу,в мене не вивело нічого*,
провірить 0>10 ,а це помилка ,і зупинить */

// 6. Яке перше значення буде виведено в консоль?
// let i = 1;
//
// do {
//   i++;
//   console.log(i);
// } while (i < 10)

/* виведе 2,i=1 і в нас є i++ тому виведе 2 і до 10 включно */
